# Sync with "brew bundle"

# Tools
brew "ffmpeg"
brew "stow"
brew "cmake"
brew "curl"
brew "fastfetch"
brew "fd"
brew "flac"
brew "fzf"
brew "gcc"
brew "git"
brew "gh"
brew "lazygit"
brew "libusb"
brew "llvm"
brew "flatbuffers"
brew "sqlite"
brew "tmux"
brew "tree"
brew "wget"

# General development
brew "neovim"
brew "bash"
brew "fish"
brew "opencode"

# Programming Langauges
brew "uv"
brew "node"
brew "rustup-init"  # needs running "rustup-init" to setup rust
brew "lua"
brew "php"

